src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="spacemacs.css">

#+TITLE: How to create a post    .

* Define your router file in your .env

#+begin_src php
ROUTES_PATH=/Users/passh/src/php/reactor/src/ddd/Infrastructure/HttpServer/Router/routes.json

#+end_src

* Arrancamos el cohete.
- Entramos en el directorio del proyecto y ejecutamos
  #+begin_src bash
  nix develop
  #+end_src

  #+begin_quote
  Hay que tener en cuenta que nix debe estar instalado en el sistema , y las experimental features nix-command y flakes deben estar activas .
  #+end_quote

  Una vez dentro  de esta consola dispondremos de la version de php indicada con xdebug , ya que por defecto se arranca con estos m칩dulos en la shell de desarrollo.

* A침adimos una nueva entrada en la tabla de rutas

#+begin_src php

[
  {
    "method": "POST",
    "path": "/post",
    "handler": "\\pascualmg\\reactor\\ddd\\Infrastructure\\HttpServer\\RequestHandler\\CreatePostController"
  }
]

#+end_src

* Creamos un el =HttpRequestHandler= aka =Controller=


Este seria el skel del que partir, no hace nada mas que responder con un 200 que no es poco 游땐

#+begin_src php
<?php

namespace pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler;

use Psr\Http\Message\ResponseInterface;
use Psr\Http\Message\ServerRequestInterface;
use React\Http\Message\Response;
use React\Promise\PromiseInterface;

class CreatePostController implements HttpRequestHandler
{

    public function __invoke(ServerRequestInterface $request, ?array $routeParams): ResponseInterface|PromiseInterface //of a response Interface
    {
        return new Response();
    }
}

#+end_src

** Una "larga y necesaria aclaraci칩n" antes de seguir.

Todos los Condroladores , deben implementar =HttpRequestHandler= , no ha de verse como una restricci칩n en absoluto, ya que reactPHP no impone aqu칤 ninguna restricci칩n se podria usar una lamda cualquiera, este tipado lo brinda el microFramework 游 , En este caso ese tipado es algo que nos brinda una clara visi칩n de lo que puede o no hacer, y debe o no hacer , nuestro controlador.

En esa firma es donde se define, ahora en php8 posibles valores de retorno, esto que podr칤a a priori parecer un smellcode si estamos con el chip funcional en mente,  por que as칤 a simple vista logicamente no es una funci칩n pura, pero si lo pensamos bien , ser칤a la manera sint치ctica de tener un tipo polim칩rfico.

#+begin_quote
El comentario al final , indica que hay un lack en el lenguaje de php para representar ese concepto, esto tambi칠n nos va a pasar en sitios como los respositorios, donde , yo puedo devolver una promise , que se resolver치 en un array de post , y como programador lo debo de saber y respetar .

Lo importante es tenerlo claro , que si vas a devolver una promise, aka *deferred* o "en diferido ..." su _resolve_ *TIENE  QUE* devolver una =ResponseInterface= , este , es un punto clave a entender
ya que es como nuestro kernel espera que sea .
#+end_quote

