src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-22 jue 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to create a post    .</title>
<meta name="author" content="Pascual M.G." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="spacemacs.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">How to create a post    .</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org03f4916">1. Define your router file in your .env</a></li>
<li><a href="#org62b4df0">2. Arrancamos el cohete.</a></li>
<li><a href="#org247fc9e">3. A침adimos una nueva entrada en la tabla de rutas</a></li>
<li><a href="#orgf633fe0">4. Creamos un el <code>HttpRequestHandler</code> aka <code>Controller</code></a>
<ul>
<li><a href="#org7e01493">4.1. Una &ldquo;larga y necesaria aclaraci칩n&rdquo; antes de seguir.</a></li>
</ul>
</li>
<li><a href="#org376262b">5. Extraemos el body</a></li>
<li><a href="#org545d91b">6. Lo m치s interesante viene ahora &#x2026;</a></li>
<li><a href="#orgbe51773">7. Curl de ejemplo 100% funcional.</a></li>
<li><a href="#orgec09a31">8. Concusiones</a></li>
</ul>
</div>
</div>
<div id="outline-container-org03f4916" class="outline-2">
<h2 id="org03f4916"><span class="section-number-2">1.</span> Define your router file in your .env</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-php"><span style="color: #a45bad;">ROUTES_PATH</span>=/Users/passh/src/php/reactor/src/ddd/Infrastructure/HttpServer/Router/routes.json

</pre>
</div>
</div>
</div>
<div id="outline-container-org62b4df0" class="outline-2">
<h2 id="org62b4df0"><span class="section-number-2">2.</span> Arrancamos el cohete.</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Entramos en el directorio del proyecto y ejecutamos
</p>
<div class="org-src-container">
<pre class="src src-bash">  nix develop
</pre>
</div>

<blockquote>
<p>
Hay que tener en cuenta que nix debe estar instalado en el sistema , y las experimental features nix-command y flakes deben estar activas .
</p>
</blockquote>

<p>
Una vez dentro  de esta consola dispondremos de la version de php indicada con xdebug , ya que por defecto se arranca con estos m칩dulos en la shell de desarrollo.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org247fc9e" class="outline-2">
<h2 id="org247fc9e"><span class="section-number-2">3.</span> A침adimos una nueva entrada en la tabla de rutas</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-php">
<span style="color: #4f97d7;">[</span>
  <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">"method"</span>: <span style="color: #2d9574;">"POST"</span>,
    <span style="color: #2d9574;">"path"</span>: <span style="color: #2d9574;">"/post"</span>,
    <span style="color: #2d9574;">"handler"</span>: <span style="color: #2d9574;">"\\pascualmg\\reactor\\ddd\\Infrastructure\\HttpServer\\RequestHandler\\CreatePostController"</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">]</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf633fe0" class="outline-2">
<h2 id="orgf633fe0"><span class="section-number-2">4.</span> Creamos un el <code>HttpRequestHandler</code> aka <code>Controller</code></h2>
<div class="outline-text-2" id="text-4">
<p>
Este seria el skel del que partir, no hace nada mas que responder con un 200 que no es poco 游땐
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #bc6ec5;">&lt;?php</span>

<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler</span>;

<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ResponseInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ServerRequestInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Http\Message\Response</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Promise\PromiseInterface</span>;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CreatePostController</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">HttpRequestHandler</span>
<span style="color: #4f97d7;">{</span>

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__invoke</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ServerRequestInterface</span> $<span style="color: #7590db;">request</span>, <span style="color: #ce537a; font-weight: bold;">?array</span> $<span style="color: #7590db;">routeParams</span><span style="color: #bc6ec5;">)</span>: <span style="color: #ce537a; font-weight: bold;">ResponseInterface</span>|PromiseInterface <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">of a response Interface</span>
    <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Response</span><span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>
</div>
<div id="outline-container-org7e01493" class="outline-3">
<h3 id="org7e01493"><span class="section-number-3">4.1.</span> Una &ldquo;larga y necesaria aclaraci칩n&rdquo; antes de seguir.</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Todos los Condroladores , deben implementar <code>HttpRequestHandler</code> , no ha de verse como una restricci칩n en absoluto, ya que reactPHP no impone aqu칤 ninguna restricci칩n se podria usar una lamda cualquiera, este tipado lo brinda el microFramework 游 , En este caso ese tipado es algo que nos brinda una clara visi칩n de lo que puede o no hacer, y debe o no hacer , nuestro controlador.
</p>

<p>
En esa firma es donde se define, ahora en php8 posibles valores de retorno, esto que podr칤a a priori parecer un smellcode si estamos con el chip funcional en mente,  por que as칤 a simple vista logicamente no es una funci칩n pura, pero si lo pensamos bien , ser칤a la manera sint치ctica de tener un tipo polim칩rfico.
</p>

<blockquote>
<p>
El comentario al final , indica que hay un lack en el lenguaje de php para representar ese concepto, esto tambi칠n nos va a pasar en sitios como los respositorios, donde , yo puedo devolver una promise , que se resolver치 en un array de post , y como programador lo debo de saber y respetar .
</p>

<p>
Lo importante es tenerlo claro , que si vas a devolver una promise, aka <b>deferred</b> o &ldquo;en diferido &#x2026;&rdquo; su <span class="underline">resolve</span> <b>TIENE  QUE</b> devolver una <code>ResponseInterface</code> , este , es un punto clave a entender
ya que es como nuestro kernel espera que sea .
</p>
</blockquote>
</div>
</div>
</div>
