src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.org
* Extraemos el body

Ahora que ya tenemos el controller devolviendo un 200 , es la hora de ver como obtenemos el payload que nos viene en la request , en este caso va a ser como un JSON , que contendr치 los par치metros necesarios para crear nuestra entidad ( y registro en la DDBB )

Para empezar y ver que todo va bien haremos primero un =EchoController= para ver que conseguimos el payload , mirando un poco de doc...

#+begin_src php -n -r
<?php

namespace pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler;

use pascualmg\reactor\ddd\Infrastructure\HttpServer\JsonResponse;
use Psr\Http\Message\ResponseInterface;
use Psr\Http\Message\ServerRequestInterface;
use React\Http\Message\Response;
use React\Promise\PromiseInterface;

class CreatePostController implements HttpRequestHandler
{

    public function __construct(
   //     private readonly PostCreator $postCreator
    )
    {
    }

    public function __invoke(ServerRequestInterface $request, ?array $routeParams): ResponseInterface|PromiseInterface
    {
        $body = $request->getBody()->getContents();
        try {
            $payload = json_decode($body, true, 512, JSON_THROW_ON_ERROR);
        } catch (\JsonException $e) {
            return JsonResponse::withError($e);
        }

        return new Response(
            200,
            ["Content-Type" => "application/json"],
            json_encode($payload)
        );
    }
}

#+end_src

Aqu칤 ya tenemos la manera de obtener f치cilmente el json que nos viene de la request , una vez la obtenemos por el momento simplemente la devolvemos tal cual nos llegue.


Lo m치s ortodoxo ser칤a pues hacer un =CommandHandler= que llame a un _Domain Service_ y este que llamara al =PostRepository= y lanzara un =DomainEvent= que ser칤a escuchado por los diferentes listeners, esto ser치 la meta, pero por el monento nos centraremos en que funcione el =save= del repositorio.


 #+begin_src php

    public function save(Post $postToCreate): PromiseInterface
    {
        $insertPostQuery = "
INSERT INTO post
(id, headline, articleBody, image, author, datePublished) VALUES
(?,?,?,?,?,?)
";
        return $this->mysqlClient->query($insertPostQuery, [
            (string)$postToCreate->id,
            $postToCreate->headline,
            $postToCreate->articleBody,
            $postToCreate->image,
            $postToCreate->author,
            $postToCreate->datePublished->format('Y-m-d H:i:s')
        ])->then(
            function (MysqlResult $mysqlResult): bool {
                $affectedRows = $mysqlResult->affectedRows;
                return $affectedRows > 0;
            },
            function (\Exception $e) {
                //Si en vez the throw hacemos return, en vez de
                //irse al onRejected , se va al onFullFilled
                //ya  que de hacerlo se entiende que la estamos solucionando
                throw $e;
            }
        );

    }
 #+end_src

