src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.html
<div id="outline-container-org376262b" class="outline-2">
<h2 id="org376262b"><span class="section-number-2">5.</span> Extraemos el body</h2>
<div class="outline-text-2" id="text-5">
<p>
Ahora que ya tenemos el controller devolviendo un 200 , es la hora de ver como obtenemos el payload que nos viene en la request , en este caso va a ser como un JSON , que contendr치 los par치metros necesarios para crear nuestra entidad ( y registro en la DDBB )
</p>

<p>
Para empezar y ver que todo va bien haremos primero un <code>EchoController</code> para ver que conseguimos el payload , mirando un poco de doc&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-php"><span class="linenr"> 1: </span><span style="color: #bc6ec5;">&lt;?php</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\JsonResponse</span>;
<span class="linenr"> 6: </span><span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ResponseInterface</span>;
<span class="linenr"> 7: </span><span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ServerRequestInterface</span>;
<span class="linenr"> 8: </span><span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Http\Message\Response</span>;
<span class="linenr"> 9: </span><span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Promise\PromiseInterface</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CreatePostController</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">HttpRequestHandler</span>
<span class="linenr">12: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__construct</span><span style="color: #bc6ec5;">(</span>
<span class="linenr">15: </span>   <span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">private readonly PostCreator $postCreator</span>
<span class="linenr">16: </span>    <span style="color: #bc6ec5;">)</span>
<span class="linenr">17: </span>    <span style="color: #bc6ec5;">{</span>
<span class="linenr">18: </span>    <span style="color: #bc6ec5;">}</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span>    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__invoke</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ServerRequestInterface</span> $<span style="color: #7590db;">request</span>, <span style="color: #ce537a; font-weight: bold;">?array</span> $<span style="color: #7590db;">routeParams</span><span style="color: #bc6ec5;">)</span>: <span style="color: #ce537a; font-weight: bold;">ResponseInterface</span>|PromiseInterface
<span class="linenr">21: </span>    <span style="color: #bc6ec5;">{</span>
<span class="linenr">22: </span>        $<span style="color: #7590db;">body</span> = $<span style="color: #7590db;">request</span>-&gt;getBody<span style="color: #2d9574;">()</span>-&gt;getContents<span style="color: #2d9574;">()</span>;
<span class="linenr">23: </span>        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #2d9574;">{</span>
<span class="linenr">24: </span>            $<span style="color: #7590db;">payload</span> = json_decode<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">body</span>, <span style="color: #a45bad;">true</span>, <span style="color: #a45bad;">512</span>, <span style="color: #a45bad;">JSON_THROW_ON_ERROR</span><span style="color: #67b11d;">)</span>;
<span class="linenr">25: </span>        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">\JsonException</span> $<span style="color: #7590db;">e</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
<span class="linenr">26: </span>            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">JsonResponse</span>::withError<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">e</span><span style="color: #67b11d;">)</span>;
<span class="linenr">27: </span>        <span style="color: #2d9574;">}</span>
<span class="linenr">28: </span>
<span class="linenr">29: </span>        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Response</span><span style="color: #2d9574;">(</span>
<span class="linenr">30: </span>            <span style="color: #a45bad;">200</span>,
<span class="linenr">31: </span>            <span style="color: #67b11d;">[</span><span style="color: #2d9574;">"Content-Type"</span> =&gt; <span style="color: #2d9574;">"application/json"</span><span style="color: #67b11d;">]</span>,
<span class="linenr">32: </span>            json_encode<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">payload</span><span style="color: #67b11d;">)</span>
<span class="linenr">33: </span>        <span style="color: #2d9574;">)</span>;
<span class="linenr">34: </span>    <span style="color: #bc6ec5;">}</span>
<span class="linenr">35: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">36: </span>
</pre>
</div>

<p>
Aqu칤 ya tenemos la manera de obtener f치cilmente el json que nos viene de la request , una vez la obtenemos por el momento simplemente la devolvemos tal cual nos llegue.
</p>


<p>
Lo m치s ortodoxo ser칤a pues hacer un <code>CommandHandler</code> que llame a un <span class="underline">Domain Service</span> y este que llamara al <code>PostRepository</code> y lanzara un <code>DomainEvent</code> que ser칤a escuchado por los diferentes listeners, esto ser치 la meta, pero por el monento nos centraremos en que funcione el <code>save</code> del repositorio.
</p>


<div class="org-src-container">
<pre class="src src-php">
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">save</span><span style="color: #4f97d7;">(</span>Post $<span style="color: #7590db;">postToCreate</span><span style="color: #4f97d7;">)</span>: <span style="color: #ce537a; font-weight: bold;">PromiseInterface</span>
    <span style="color: #4f97d7;">{</span>
        $<span style="color: #7590db;">insertPostQuery</span> = <span style="color: #2d9574;">"</span>
<span style="color: #2d9574;">INSERT INTO post</span>
<span style="color: #2d9574;">(id, headline, articleBody, image, author, datePublished) VALUES</span>
<span style="color: #2d9574;">(?,?,?,?,?,?)</span>
<span style="color: #2d9574;">"</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">$</span><span style="color: #a45bad;">this</span>-&gt;<span style="color: #7590db;">mysqlClient</span>-&gt;query<span style="color: #bc6ec5;">(</span>$<span style="color: #7590db;">insertPostQuery</span>, <span style="color: #2d9574;">[</span>
            <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #67b11d;">)</span>$<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">id</span>,
            $<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">headline</span>,
            $<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">articleBody</span>,
            $<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">image</span>,
            $<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">author</span>,
            $<span style="color: #7590db;">postToCreate</span>-&gt;<span style="color: #7590db;">datePublished</span>-&gt;format<span style="color: #67b11d;">(</span><span style="color: #2d9574;">'Y-m-d H:i:s'</span><span style="color: #67b11d;">)</span>
        <span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>-&gt;then<span style="color: #bc6ec5;">(</span>
            <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">MysqlResult</span> $<span style="color: #7590db;">mysqlResult</span><span style="color: #2d9574;">)</span>: <span style="color: #ce537a; font-weight: bold;">bool</span> <span style="color: #2d9574;">{</span>
                $<span style="color: #7590db;">affectedRows</span> = $<span style="color: #7590db;">mysqlResult</span>-&gt;<span style="color: #7590db;">affectedRows</span>;
                <span style="color: #4f97d7; font-weight: bold;">return</span> $<span style="color: #7590db;">affectedRows</span> &gt; <span style="color: #a45bad;">0</span>;
            <span style="color: #2d9574;">}</span>,
            <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">\Exception</span> $<span style="color: #7590db;">e</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
                <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Si en vez the throw hacemos return, en vez de</span>
                <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">irse al onRejected , se va al onFullFilled</span>
                <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">ya  que de hacerlo se entiende que la estamos solucionando</span>
                <span style="color: #4f97d7; font-weight: bold;">throw</span> $<span style="color: #7590db;">e</span>;
            <span style="color: #2d9574;">}</span>
        <span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
