src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.org
* Lo m치s interesante viene ahora ...
 En este snapshot del controller , no voy a extraer aun ninguna func , en si el c칩digo
 es bastante "normal" y me refiero a "s칤ncrono" hasta que llega el return y es donde entra en escena la m치gia de reactPHP.

 Sin duda esas 2 l칤neas son las que m치s llaman la atenci칩n a quien est칠 acostumbrado a frameworks no as칤ncronos

 #+begin_src php
<?php

namespace pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler;

use Fig\Http\Message\StatusCodeInterface;
use pascualmg\reactor\ddd\Domain\Entity\Post;
use pascualmg\reactor\ddd\Domain\Entity\PostRepository;
use pascualmg\reactor\ddd\Domain\ValueObject\Uuid;
use pascualmg\reactor\ddd\Infrastructure\HelperFunctions\ExceptionTo;
use pascualmg\reactor\ddd\Infrastructure\HttpServer\JsonResponse;
use Psr\Http\Message\ResponseInterface;
use Psr\Http\Message\ServerRequestInterface;
use React\Http\Message\Response;
use React\Promise\PromiseInterface;

class CreatePostController implements HttpRequestHandler
{
    public function __construct(
        private readonly PostRepository $postRepository
    ) {
    }

   public function __invoke(ServerRequestInterface $request, ?array $routeParams): ResponseInterface|PromiseInterface
    {
        $body = $request->getBody()->getContents();
        try {
            $payload = json_decode($body, true, 512, JSON_THROW_ON_ERROR);
        } catch (\JsonException $e) {
            return JsonResponse::withError($e);
        }
        $postToCreate = new Post(
            id: Uuid::from($payload['id']),
            headline: $payload['headline'],
            articleBody: $payload['articleBody'],
            image: $payload['image'],
            author: $payload['author'],
            datePublished: new \DateTimeImmutable($payload['datePublished']),
        );

        return $this->postRepository->save($postToCreate)->then(
            static fn (Bool $affectedRows) => JsonResponse::create(StatusCodeInterface::STATUS_CREATED, [$affectedRows]),
            static fn (\Exception $error) => JsonResponse::withError($error)
        );
    }

}

 #+end_src

 Aqu칤 es donde cobra m치s sentido ese comentario que la funci칩n =save= del repositorio tiene.

 Si dentro de esa funci칩n, no lanzamos la excepci칩n hacia afuera, ir칤a al =onSuccess= ya que considerar칤a como manejada , y no es lo que queremos.

 Entiendo que, si quito el =onRejected=, se comportar치 exactamente igual. Pero ahora que funcioba bien no lo voy a tocar , por el momento 游땐.

* Curl de ejemplo 100% funcional.

Con este peque침o snippet, genero los uuids para pruebas rapidamente, me parece sin duda mejor alternativa que la que nos proporciona la web .
#+begin_src php :results output both
require __DIR__ . '/../vendor/autoload.php';
use Ramsey\Uuid\Uuid;
$uuid = Uuid::uuid4();
$uuidString = $uuid->toString();
echo $uuidString;
#+end_src

#+RESULTS:
: d32ea57f-6f8b-472b-bac8-845445b548e5

Y un curl que funciona
#+begin_src bash :results output both
curl --location --request POST 'http://localhost:8000/post' \
--header 'Content-Type: application/json' \
--data-raw '{
          "id": "d32ea57f-6f8b-472b-bac8-845445b548e5",
          "headline": "Sample Headline",
          "articleBody": "Sample Article Body",

          "image": "image url",
          "author": "Author Name",
          "datePublished": "2023-04-13 18:31:30"
        }'
#+end_src

