src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.html
<div id="outline-container-org545d91b" class="outline-2">
<h2 id="org545d91b"><span class="section-number-2">6.</span> Lo m치s interesante viene ahora &#x2026;</h2>
<div class="outline-text-2" id="text-6">
<p>
En este snapshot del controller , no voy a extraer aun ninguna func , en si el c칩digo
es bastante &ldquo;normal&rdquo; y me refiero a &ldquo;s칤ncrono&rdquo; hasta que llega el return y es donde entra en escena la m치gia de reactPHP.
</p>

<p>
Sin duda esas 2 l칤neas son las que m치s llaman la atenci칩n a quien est칠 acostumbrado a frameworks no as칤ncronos
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #bc6ec5;">&lt;?php</span>

<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler</span>;

<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Fig\Http\Message\StatusCodeInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Domain\Entity\Post</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Domain\Entity\PostRepository</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Domain\ValueObject\Uuid</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HelperFunctions\ExceptionTo</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\JsonResponse</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ResponseInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ServerRequestInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Http\Message\Response</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Promise\PromiseInterface</span>;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CreatePostController</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">HttpRequestHandler</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__construct</span><span style="color: #bc6ec5;">(</span>
        <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">readonly</span> PostRepository $<span style="color: #7590db;">postRepository</span>
    <span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #bc6ec5;">}</span>

   <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__invoke</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ServerRequestInterface</span> $<span style="color: #7590db;">request</span>, <span style="color: #ce537a; font-weight: bold;">?array</span> $<span style="color: #7590db;">routeParams</span><span style="color: #bc6ec5;">)</span>: <span style="color: #ce537a; font-weight: bold;">ResponseInterface</span>|PromiseInterface
    <span style="color: #bc6ec5;">{</span>
        $<span style="color: #7590db;">body</span> = $<span style="color: #7590db;">request</span>-&gt;getBody<span style="color: #2d9574;">()</span>-&gt;getContents<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #2d9574;">{</span>
            $<span style="color: #7590db;">payload</span> = json_decode<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">body</span>, <span style="color: #a45bad;">true</span>, <span style="color: #a45bad;">512</span>, <span style="color: #a45bad;">JSON_THROW_ON_ERROR</span><span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">\JsonException</span> $<span style="color: #7590db;">e</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">JsonResponse</span>::withError<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">e</span><span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>
        $<span style="color: #7590db;">postToCreate</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Post</span><span style="color: #2d9574;">(</span>
            id: <span style="color: #a45bad;">Uuid</span>::from<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">payload</span><span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'id'</span><span style="color: #4f97d7;">]</span><span style="color: #67b11d;">)</span>,
            headline: $<span style="color: #7590db;">payload</span><span style="color: #67b11d;">[</span><span style="color: #2d9574;">'headline'</span><span style="color: #67b11d;">]</span>,
            articleBody: $<span style="color: #7590db;">payload</span><span style="color: #67b11d;">[</span><span style="color: #2d9574;">'articleBody'</span><span style="color: #67b11d;">]</span>,
            image: $<span style="color: #7590db;">payload</span><span style="color: #67b11d;">[</span><span style="color: #2d9574;">'image'</span><span style="color: #67b11d;">]</span>,
            author: $<span style="color: #7590db;">payload</span><span style="color: #67b11d;">[</span><span style="color: #2d9574;">'author'</span><span style="color: #67b11d;">]</span>,
            datePublished: <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">\DateTimeImmutable</span><span style="color: #67b11d;">(</span>$<span style="color: #7590db;">payload</span><span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'datePublished'</span><span style="color: #4f97d7;">]</span><span style="color: #67b11d;">)</span>,
        <span style="color: #2d9574;">)</span>;

        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">$</span><span style="color: #a45bad;">this</span>-&gt;<span style="color: #7590db;">postRepository</span>-&gt;save<span style="color: #2d9574;">(</span>$<span style="color: #7590db;">postToCreate</span><span style="color: #2d9574;">)</span>-&gt;then<span style="color: #2d9574;">(</span>
            <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #67b11d;">(</span>Bool $<span style="color: #7590db;">affectedRows</span><span style="color: #67b11d;">)</span> =&gt; <span style="color: #a45bad;">JsonResponse</span>::create<span style="color: #67b11d;">(</span><span style="color: #a45bad;">StatusCodeInterface</span>::<span style="color: #a45bad;">STATUS_CREATED</span>, <span style="color: #4f97d7;">[</span>$<span style="color: #7590db;">affectedRows</span><span style="color: #4f97d7;">]</span><span style="color: #67b11d;">)</span>,
            <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">\Exception</span> $<span style="color: #7590db;">error</span><span style="color: #67b11d;">)</span> =&gt; <span style="color: #a45bad;">JsonResponse</span>::withError<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">error</span><span style="color: #67b11d;">)</span>
        <span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>

<span style="color: #4f97d7;">}</span>

</pre>
</div>

<p>
Aqu칤 es donde cobra m치s sentido ese comentario que la funci칩n <code>save</code> del repositorio tiene.
</p>

<p>
Si dentro de esa funci칩n, no lanzamos la excepci칩n hacia afuera, ir칤a al <code>onSuccess</code> ya que considerar칤a como manejada , y no es lo que queremos.
</p>

<p>
Entiendo que, si quito el <code>onRejected</code>, se comportar치 exactamente igual. Pero ahora que funcioba bien no lo voy a tocar , por el momento 游땐.
</p>
</div>
</div>
<div id="outline-container-orgbe51773" class="outline-2">
<h2 id="orgbe51773"><span class="section-number-2">7.</span> Curl de ejemplo 100% funcional.</h2>
<div class="outline-text-2" id="text-7">
<p>
Con este peque침o snippet, genero los uuids para pruebas rapidamente, me parece sin duda mejor alternativa que la que nos proporciona la web .
</p>
<div class="org-src-container">
<pre class="src src-php"><span style="color: #4f97d7; font-weight: bold;">require</span> <span style="color: #4f97d7;">__DIR__</span> . <span style="color: #2d9574;">'/../vendor/autoload.php'</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Ramsey\Uuid\Uuid</span>;
$<span style="color: #7590db;">uuid</span> = <span style="color: #a45bad;">Uuid</span>::uuid4<span style="color: #4f97d7;">()</span>;
$<span style="color: #7590db;">uuidString</span> = $<span style="color: #7590db;">uuid</span>-&gt;toString<span style="color: #4f97d7;">()</span>;
<span style="color: #4f97d7; font-weight: bold;">echo</span> $<span style="color: #7590db;">uuidString</span>;
</pre>
</div>

<p>
Y un curl que funciona
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ce537a; font-weight: bold;">curl</span> --location --request POST <span style="color: #2d9574;">'http://localhost:8000/post'</span> <span style="color: #2d9574;">\</span>
--header <span style="color: #2d9574;">'Content-Type: application/json'</span> <span style="color: #2d9574;">\</span>
--data-raw <span style="color: #2d9574;">'{</span>
<span style="color: #2d9574;">          "id": "d32ea57f-6f8b-472b-bac8-845445b548e5",</span>
<span style="color: #2d9574;">          "headline": "Sample Headline",</span>
<span style="color: #2d9574;">          "articleBody": "Sample Article Body",</span>

<span style="color: #2d9574;">          "image": "image url",</span>
<span style="color: #2d9574;">          "author": "Author Name",</span>
<span style="color: #2d9574;">          "datePublished": "2023-04-13 18:31:30"</span>
<span style="color: #2d9574;">        }'</span>
</pre>
</div>
</div>
</div>
