src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.org
* Concusiones

Pese a lo parecido del c칩digo con enfoques m치s tradicionales, aqu칤 estamos haciendo uso de la capacidad as칤ncrona de PHP.
Hay que tener en cuenta que la devoluci칩n de la promise , se realiza en el mismo momento de la llamada , pero que no es hasta que se resuelve esta promesa que crea el nuevo registro que no se devuelve el resultado.

Lo m치s interesante , es que mientras esto sucede nuestro server puede seguir procesando peticiones de forma concurrente.

Os animais a probar ? Que os parece esta forma de elevar a PHP hacia un paradigma m치s as칤ncrono ?
