src/ddd/Infrastructure/webserver/html/org/how-to-create-a-new-post.html
<div id="outline-container-orgec09a31" class="outline-2">
<h2 id="orgec09a31"><span class="section-number-2">8.</span> Concusiones</h2>
<div class="outline-text-2" id="text-8">
<p>
Pese a lo parecido del c칩digo con enfoques m치s tradicionales, aqu칤 estamos haciendo uso de la capacidad as칤ncrona de PHP.
Hay que tener en cuenta que la devoluci칩n de la promise , se realiza en el mismo momento de la llamada , pero que no es hasta que se resuelve esta promesa que crea el nuevo registro que no se devuelve el resultado.
</p>

<p>
Lo m치s interesante , es que mientras esto sucede nuestro server puede seguir procesando peticiones de forma concurrente.
</p>

<p>
Os animais a probar ? Que os parece esta forma de elevar a PHP hacia un paradigma m치s as칤ncrono ?
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pascual M.G.</p>
<p class="date">Created: 2024-02-22 jue 12:23</p>
</div>
</body>
</html>
